tap 'homebrew/cask'
tap 'homebrew/services'
tap 'neovim/neovim'
tap 'thoughtbot/formulae'

cask_args appdir: '/Applications'

#####################
# Command line apps #
#####################

# development packages
brew 'coreutils'
brew 'gdbm'
brew 'git'
brew 'libffi'
brew 'libksba'
brew 'libyaml'
brew 'openssl'
brew 'readline'
brew 'qt5'
brew 'subversion'

# editor
brew 'neovim'

# JS/node
brew 'node'
brew 'yarn'
brew 'jsonlint'

# Package management
brew 'mas'

# ruby
brew 'rbenv'
brew 'ruby-build'

# unix
brew 'bash'
brew 'dnsmasq'
brew 'ctags'
brew 'htop-osx'
brew 'rcm'
brew 'the_silver_searcher'
brew 'tmux'
brew 'wget'
brew 'zsh'

#############
## GUI apps #
#############

# alfred
cask 'alfred'

# APIs
cask 'postman'

# browsers
cask 'google-chrome'
cask 'homebrew/cask-versions/google-chrome-canary'
cask 'firefox'
cask 'homebrew/cask-versions/firefox-developer-edition'

# cloud
cask 'cyberduck'
cask 'dropbox'

# development
cask 'browserstacklocal'
cask 'dash'
# mas 'Xcode', id: 497799835

# editors
cask 'atom'
cask 'macvim'
cask 'sublime-text'

# harvest
mas 'Harvest', id: 506189836

# macOS utilities
cask 'disk-inventory-x'
cask 'cleanmymac'
cask 'grandperspective'
mas 'ResolutionTab', id: 540141595

# media
cask 'vlc'

# networking
# mas 'IP Scanner', id: 404167149
# mas 'WiFi Explorer', id: 494803304
# mas 'WiFi Signal', id: 525912054

# postgres
cask 'pgadmin4'
cask 'dbeaver-community'

# skype
cask 'skype'

# slack
mas 'Slack', id: 803453959

# terminal
cask 'iterm2'

# docker
cask 'docker'
