tap 'homebrew/cask'
tap 'homebrew/services'
tap 'neovim/neovim'

cask_args appdir: '/Applications'

#####################
# Command line apps #
#####################

# development packages
brew 'coreutils'
brew 'curl'
brew 'dnsmasq'
brew 'gawk'
brew 'gdbm'
brew 'git'
brew 'gmp'
brew 'gpg'
brew 'htop-osx'
brew 'libffi'
brew 'libksba'
brew 'libyaml'
brew 'mas'
brew 'openssl'
brew 'readline'
brew 'tmux'
brew 'wget'
brew 'zsh'

#############
## GUI apps #
#############

# APIs
cask 'postman'

# browsers
cask 'google-chrome'
cask 'homebrew/cask-versions/google-chrome-canary'
cask 'firefox'
cask 'homebrew/cask-versions/firefox-developer-edition'

# cloud
cask 'cyberduck'

# development
cask 'browserstacklocal'
cask 'docker'
# mas 'Xcode', id: 497799835
cask 'visual-studio-code'

# harvest
mas 'Harvest', id: 506189836

# macOS utilities
cask 'disk-inventory-x'

# media
cask 'vlc'

# postgres
cask 'dbeaver-community'

# slack
mas 'Slack', id: 803453959

# terminal
cask 'iterm2'
